var data = [];
var datastr = '1、触不到的恋人<br/>\
<br/>\
导演: 阿莱贾德罗·阿格里斯蒂 Alejandro Agresti<br/>\
编剧: 桑德拉·布洛克<br/>\
主演: 基诺·李维斯 Keanu Reeves 桑德拉·布洛克 Sandra Bullock<br/>\
类型: 爱情<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 2006年6月16日<br/>\
片长: 145min/Philippines:140min<br/>\
<br/>\
<br/>\
2、艺伎回忆录<br/>\
<br/>\
导演: 罗伯·马歇尔<br/>\
编剧: 罗宾·史威考德，阿瑟·高登<br/>\
主演: 章子怡，渡边谦，杨紫琼，巩俐<br/>\
类型: 爱情，剧情，音乐<br/>\
制片地区: 美国<br/>\
对白语言: 英语日语<br/>\
上映时间: 2005年<br/>\
片长: 145min/Philippines:140min<br/>\
<br/>\
<br/>\
2、艺伎回忆录<br/>\
<br/>\
导演: 罗伯·马歇尔<br/>\
编剧: 罗宾·史威考德，阿瑟·高登<br/>\
主演: 章子怡，渡边谦，杨紫琼，巩俐<br/>\
类型: 爱情，剧情，音乐<br/>\
制片地区: 美国<br/>\
对白语言: 英语日语<br/>\
上映时间: 2005年<br/>\
片长: 145min/Philippines:140min<br/>\
<br/>\
<br/>\
3、重返荣耀<br/>\
<br/>\
导演: 罗伯特·雷德福<br/>\
主演: 威尔·史密斯，马特·达蒙，乔·格拉什<br/>\
类型: 爱情<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 2000-11-03<br/>\
片长: 126分钟<br/>\
<br/>\
<br/>\
4、小情人<br/>\
<br/>\
导演: 锦格菲维姆<br/>\
主演: 查郎谱狄锦邦提哇旺， 霍嘉丝芝华顾<br/>\
类型: 爱情<br/>\
制片地区: 泰国<br/>\
对白语言: 泰语<br/>\
上映时间: 2003年8月1日<br/>\
片长: 110分钟<br/>\
<br/>\
<br/>\
5、明亮的星<br/>\
<br/>\
导演: 简·坎皮恩 Jane Campion<br/>\
主演: 本·威士肖艾比·考尼什托马斯·桑斯特<br/>\
类型: 爱情 / 剧情<br/>\
制片地区: 英国 / 澳大利亚 / 美国 / 法国<br/>\
对白语言: 英语<br/>\
上映时间: 2009<br/>\
片长: 119分钟<br/>\
<br/>\
<br/>\
6、夜之州<br/>\
<br/>\
导演: Shane Dax Taylor<br/>\
主演: 方·基默，希拉里·达芙，克里斯·克里斯托佛森<br/>\
类型: 爱情剧情<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 2011-05-20<br/>\
片长: 105分钟<br/>\
<br/>\
<br/>\
7、无处的男孩<br/>\
<br/>\
导演: 萨姆·泰勒·伍德<br/>\
主演: 克里斯汀·斯科特·托马斯,亚伦·泰勒-约翰逊<br/>\
类型: 剧情 / 音乐 / 传记<br/>\
制片地区: 英国/加拿大<br/>\
对白语言: 英语<br/>\
上映时间: 2009年12月25日<br/>\
片长: 98分钟<br/>\
<br/>\
<br/>\
8、公众之敌<br/>\
<br/>\
导演: 迈克尔·曼<br/>\
主演: 强尼·德普，克里斯蒂安·贝尔，玛丽昂·歌迪亚<br/>\
类型: 剧情，动作，犯罪<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 2009年<br/>\
片长: 140分钟<br/>\
<br/>\
<br/>\
9、来自蒂姆·巴克利的问候<br/>\
<br/>\
导演: Daniel Algrant<br/>\
主演: 佩恩·拜德格雷/ William Sadler/ Frank Woodward<br/>\
类型: 剧情<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 2013年09月12日<br/>\
片长: 110分钟<br/>\
<br/>\
<br/>\
10、去火星的男人<br/>\
<br/>\
导演: 金正权<br/>\
主演: 申河均，金喜善，金民俊，朴素贤<br/>\
类型: 爱情，剧情<br/>\
制片地区: 韩国<br/>\
对白语言: 韩语<br/>\
上映时间: 2003年5月16日<br/>\
片长: 107分钟<br/>\
<br/>\
<br/>\
11、北京遇上西雅图<br/>\
<br/>\
导演: 薛晓路<br/>\
主演: 汤唯 / 吴秀波 / 海清 / 宋美曼 / 宋美慧<br/>\
类型: 喜剧 / 爱情<br/>\
制片地区: 中国大陆<br/>\
对白语言: 英语 / 汉语普通话<br/>\
上映时间:2013-03-21<br/>\
片长: 123分钟<br/>\
<br/>\
<br/>\
12、犯罪少年<br/>\
<br/>\
导演: 康理贯<br/>\
主演: 李贞贤，徐英洙，崔元泰<br/>\
类型: 剧情<br/>\
制片地区: 韩国<br/>\
对白语言: 韩语<br/>\
上映时间:2012年<br/>\
片长: 107分钟<br/>\
<br/>\
<br/>\
13、迷幻桌球<br/>\
<br/>\
导演: Mars Callahan<br/>\
主演: 未知<br/>\
类型: 剧情<br/>\
制片地区: 美国<br/>\
对白语言: 英语语<br/>\
上映时间:2002年<br/>\
片长: 99分钟<br/>\
<br/>\
<br/>\
14、大象的眼泪<br/>\
<br/>\
导演: 克里斯托弗·瓦尔兹<br/>\
主演: 罗伯特·帕丁森,瑞茜·威瑟斯彭<br/>\
类型: 剧情<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间:2011年4月22<br/>\
片长: 122分钟<br/>\
<br/>\
<br/>\
15、漂亮男孩<br/>\
<br/>\
导演: 古桑 Shawn Ku<br/>\
主演: 迈克尔·辛 Michael Sheen，玛丽亚·贝罗<br/>\
类型: 家庭，剧情<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 2011年<br/>\
片长: 120分钟<br/>\
<br/>\
<br/>\
16、三剑客之子<br/>\
<br/>\
导演: Aubrey Wisberg/Jack Pollexfen<br/>\
主演: 柯纳·王尔德 / 玛琳·奥哈拉<br/>\
类型: 冒险<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 1952-04-09<br/>\
片长: 81分钟<br/>\
<br/>\
<br/>\
17、一天<br/>\
<br/>\
导演: 罗勒·莎菲<br/>\
主演: 安妮·海瑟薇 / 吉姆·斯特吉斯<br/>\
类型: 爱情 / 剧情<br/>\
制片地区: 美国/英国<br/>\
对白语言: 英语<br/>\
上映时间: 2011年08月19日<br/>\
片长: 100分钟<br/>\
<br/>\
<br/>\
18、棕兔<br/>\
<br/>\
导演: 文森特·加洛 Vincent Gallo<br/>\
主演: 安妮·海瑟薇 / 吉姆·斯特吉斯<br/>\
类型: 剧情 / 成人<br/>\
制片地区: 美国<br/>\
对白语言: 英语<br/>\
上映时间: 2013<br/>\
片长: 110分钟<br/>\
';

var d = datastr.split("<br/><br/><br/>");
for(var i = 0; i<d.length; i++){
	var c = d[i].split("<br/><br/>");

	data.push({ 
         	img: c[0].replace("、"," ")+".jpg",
         	caption: c[0].split("、")[1],
            desc: c[1]
         });
	console.log( c[0].replace("、","")+".jpg");	
}